# ble_keymap.py
# 蓝牙通信协议键值映射

KEY_MAP = {
    # 按键映射
    "A1": "按键@: 单击",
    "B1": "按键@: 长按",
    "C1": "按键@: 长按释放",

    "A2": "按键A: 单击",
    "B2": "按键A: 长按",
    "C2": "按键A: 长按释放",

    "A3": "按键B: 单击",
    "B3": "按键B: 长按",
    "C3": "按键B: 长按释放",

    "A4": "按键C: 单击",
    "B4": "按键C: 长按",
    "C4": "按键C: 长按释放",

    "A5": "按键D: 单击",
    "B5": "按键D: 长按",
    "C5": "按键D: 长按释放",

    "A6": "按键R: 单击",  # 侧键下
    "B6": "按键R: 长按",
    "C6": "按键R: 长按释放",

    "A7": "按键L: 单击",  # 侧键上
    "B7": "按键L: 长按",
    "C7": "按键L: 长按释放",

    # 遥杆方向
    "D0": "方向: 无",
    "D1": "方向: 上",
    "D2": "方向: 下",
    "D3": "方向: 左",
    "D4": "方向: 右",
    "D5": "方向: 左上",
    "D6": "方向: 左下",
    "D7": "方向: 右上",
    "D8": "方向: 右下",
}
